# Pandas dataframe copydeep=T:F

# How to take a copy of dataframe

In [1]:
import pandas as pd

In [2]:
data = pd.DataFrame({
    "First":[100,2]
})

In [3]:
data

   First
0    100
1      2

In [4]:
data1 = data.copy()

In [6]:
data1

   First
0    100
1      2

In [7]:
id(data)

3091738078032

In [8]:
id(data1)

3091742894928

# Actually, this will create a seperate memory and its acts as a new object with the calling objects data and indexes copy of the calling object is data no copy of the values

In [9]:
# If we change the data, using at[]

In [11]:
data1.at[0, "First"]

100

In [12]:
data1.at[0, "First"] = 1

In [13]:
data1

   First
0      1
1      2

In [14]:
data

   First
0    100
1      2

In [15]:
# See the copy will change only the duplicate. Not the original value.

In [16]:
data1 = data.copy(deep=True)# This is also impt attribute. See this also never change the original

In [17]:
data1

   First
0    100
1      2

In [18]:
data

   First
0    100
1      2

In [19]:
data1.at[0, "First"] = 100000

In [20]:
data1

    First
0  100000
1       2

In [21]:
data

   First
0    100
1      2

# See now we are going to use deep=False. This will change the values in the original dataframe also. Bcoz, it takes it's calling object values also

In [22]:
data

   First
0    100
1      2

In [24]:
data_new = data.copy(deep=False)

In [25]:
data_new

   First
0    100
1      2

In [26]:
data_new.at[0, "First"] = 5000

In [27]:
data_new

   First
0   5000
1      2

In [28]:
data

   First
0   5000
1      2

# See, now both original and copy reflects same values. This deep=False will change the original values of data also

# This will create a new object without copying the data and indexes of the calling object. Any changes to the data will be reflected in the copy also